{
    "0" : {
        "en" : "Hello special agent !&#xA;&#xA;We just learned that top-secret documents have been stolen and we must recover them.",
        "fr" : "Bonjour",
        "cn" : "你好",
        "jp" : "こんにちは",
        "es" : "Hola",
        
        "img" : "drophere.png",

        "options" : {
            "en" : {
                "Niveau1.1" : "Hello?",
                "Niveau1.2" : "Ewww",
                "Niveau1.3" : "I'm a robot"
            },
            "fr" : {
                "Niveau1.1" : "Bonjour?",
                "Niveau1.2" : "Ewww",
                "Niveau1.3" : "Je suis un robot"
            },
            "cn" : {
                "Niveau1.1" : "你好？",
                "Niveau1.2" : "好恶心！",
                "Niveau1.3" : "我是机器人"
            },
            "jp" : {
                "Niveau1.1" : "こんにちは？",
                "Niveau1.2" : "Ewww",
                "Niveau1.3" : "私はロボットです"
            },
            "es" : {
                "Niveau1.1" : "Hola?",
                "Niveau1.2" : "Ewww",
                "Niveau1.3" : "Soy un robot"
            }
        },
        "action" : "lv1"
    },


    "Niveau1.0" : {
        "fr" : "23 août 2041...&#xA;&#xA;Vous avez un message...",
        "en" : "August 23, 2041...&#xA;&#xA;You have a message...",
        "cn" : "8月23日, 2041年...&#xA;&#xA;你有一条消息...",
        "jp" : "2041年8月23日...&#xA;&#xA;あなたはメッセージを持っています...",
        "es" : "23 de agosto de 2041...&#xA;&#xA;Tienes un mensaje...",
        "img" : "drophere.png"
    },
	"Niveau1.1" : {
        "fr" : "Bonjour agent special !&#xA;&#xA;Nous venons d'apprendre que des documents top-secrets ont été volés et nous devons les récupérer.",
        "en" : "Hello special agent !&#xA;&#xA;We just learned that top-secret documents have been stolen and we must recover them.",
        "cn" : "你好特工！&#xA;&#xA;我们刚刚得知一些机密文件被盗，我们必须取回它们。",
        "jp" : "こんにちはスペシャルエージェント！&#xA;&#xA;私たちは、秘密のドキュメントが盗まれたことを知ったばかりで、それらを回収しなければなりません。",
        "es" : "Hola agente especial!&#xA;&#xA;Acabamos de enterarnos de que documentos secretos han sido robados y debemos recuperarlos.",
        "img" : "drophere.png"
    },
	"Niveau1.2" : {
        "fr" : "Nous avons envoyé sur le terrain un prototype de robot, son nom de code est Karl.",
        "en" : "We have sent a prototype robot to the field, his code name is Karl.",
        "cn" : "我们已经派出了一个机器人原型，他的代号是卡尔。",
        "img" : "drophere.png"
    },
	"Niveau1.3" : {
        "fr" : "Pour le contrôler à distance vous devrez lui envoyer les bonnes actions. Vous pouvez donner des ordres à Karl en faisant glisser les actions dans la zone de programme.",
        "en" : "To control him remotely you will have to send him the right actions. You can give orders to Karl by dragging the actions into the program area.",
        "cn" : "要远程控制他，你必须发送正确的指令。你可以通过拖动动作到程序区域来给卡尔下达命令。",
        "img" : "drophere.png"
    },
	"Niveau1.4" : {
        "fr" : "Si vous vous trompez vous pouvez utiliser le clic droit sur une action du programme pour la supprimer, ou nettoyer tout le programme à l'aide de la petite balayette.",
        "en" : "If you make a mistake you can use the right click on an action of the program to delete it, or clean the whole program using the little broom.",
        "cn" : "如果你犯了错误，你可以使用右键单击程序中的动作来删除它，或者使用小扫帚清除整个程序。",
        "img" : "resetButton.png"
    },
	"Niveau1.5" : {
        "fr" : "Pour téléporter Karl dans le bâtiment vous devez lui commander de se déplacer sur le téléporteur rouge !",
        "en" : "To teleport Karl into the building you must order him to move to the red teleporter !",
        "cn" : "要把卡尔传送到建筑物中，你必须让他移动到红色传送门！",
        "img" : "drophere.png"
    },
	"Niveau1.6" : {
        "fr" : "A vous de jouer, essayez d'utiliser l'action 'Avancer' dans la zone de programme du robot et cliquez sur le bouton lecture pour envoyer le programme à Karl.",
        "en" : "It's up to you, try to use the 'Move' action in the robot's program area and click on the play button to send the program to Karl.",
        "cn" : "轮到你了，试着在机器人的程序区域使用“移动”动作，然后点击播放按钮将程序发送给卡尔。",
        "img" : "FirstActionAndPlay.png"
    }
}