{
    "askName" : {
        "en" : "Oh hey! Didn't see you there \nWhat's your name?",
        "fr" : "Oh hey! Je ne t'avais pas vu \nComment t'appelles-tu?",        
        
        "action" : "askName"
    },
    
    "gotName" : {
        "en" : "Nice to meet you {name}! \nMy name is K",
        "fr" : "Ravi de te rencontrer {name}! \nJe m'appelle K",
        
        "options" : {
            "en": {
                "gotName.1": "What does if stands for?",
                "gotName.2": "That's weird name"
            },
            "fr": {
                "gotName.1": "Qu'est-ce que ça veut dire?",
                "gotName.2": "C'est un nom bizarre"
            }
        }
    },
    
    "gotName.1" : {
        "en" : "I dunno, just K I guess",
        "fr" : "Je ne sais pas, juste K je suppose",
        "action" : "next,born.0"
    },
    
    "gotName.2" : {
        "en" : "I know, I know, but I like it",
        "fr" : "Je sais, je sais, mais j'aime bien",
        "action" : "next,born.0"
    },
    
    "born.0" : {
        "en" : "So I don't know why I'm here, will you help me figure it out?\nLet's start with this building",
        "fr" : "Donc je ne sais pas pourquoi je suis ici, tu m'aideras à le découvrir?\nCommençons par ce bâtiment"
    },
    
    "askDifficulty": {
        "en" : "Wow, that was kinda hard for me to understand, what about you?",
        "fr" : "Wow, c'était un peu dur pour moi à comprendre, et toi?",
        "options" : {
            "en": {
                "askDifficulty.hard": "I had no idea what I was doing",
                "askDifficulty.medium": "I kinda undertood",
                "askDifficulty.easy": "Easy peasy"
            },
            "fr": {
                "askDifficulty.hard": "Je n'avais aucune idée de ce que je faisais",
                "askDifficulty.medium": "J'ai un peu compris",
                "askDifficulty.easy": "Facile comme bonjour"
            }
        }
    },
    
    "askDifficulty.hard" : {
        "en" : "I know right! \nLet's just try to take it slow, I'm sure we can make it!", 
        "fr" : "Je sais, n'est-ce pas! \nEssayons juste de prendre le temps, je suis sûr qu'on peut y arriver!",
        "action" : "changeDiff,-1"
    },
    
    "askDifficulty.medium" : {
        "en" : "That's already not bad! Let's keep up the good work shall we?", 
        "fr" : "C'est déjà pas mal! Continuons le bon travail, non?",
        "action" : "changeDiff,0"
    },
    
    "askDifficulty.easy" : {
        "en" : "Ooooh look at you! We'll get there in no time!", 
        "fr" : "Ooooh regarde toi! On y arrivera en un rien de temps!",
        "action" : "changeDiff,1"
    },

    "Intro-intro-6.0" : {
        "en" : "Oh by the way,  did you see that big tower over there?\nIt seems like you can skip all the levels before and enter straight into the tower.\nWell I'm not sure if it's a good idea for now since we know almost nothing about the levels ahead.\nBut hey, if you got bored next time, or you feel like you have already played the levels, I'm not stopping you from going",
        "fr" : "Oh au fait, as-tu vu cette grande tour là-bas?\nIl semble que tu puisses sauter tous les niveaux avant et entrer directement dans la tour.\nEh bien, je ne suis pas sûr que ce soit une bonne idée pour le moment, car nous ne savons presque rien sur les niveaux à venir.\nMais bon, si tu t'ennuies la prochaine fois, ou si tu te sens déjà avoir joué aux niveaux, je ne t'empêche pas d'aller"
    }
}